{
    "Job Title": "Data Analyst",
    "Company": "DAZN",
    "Portal Link": "https://in.indeed.com/",
    "job listing link": "https://in.indeed.com/rc/clk?jk=73e3846ee509538a&bb=qJDWExsZnQ1VQ7neQdNUpK1lHxGi_apGqrqBv6c3-_oJ2D9vY0jsVb7EZOnfMjUeLr8BfGl5lZjazpSU4plM1qbGIGah4JfwNir-SOTOtO-O_m2mDRxx-_m6x_M-9AQa&xkcb=SoDv67M38zocq2XXi50MbzkdCdPP&fccid=6575d54d1d37e3b7&vjs=3",
    "Location": "Hyderabad, Telangana",
    "Date of Posting": "date not provided",
    "Salary": "salary not provided",
    "Ratings": "3.4",
    "Shift and Schedule": [
        "Shift and schedule not provided"
    ],
    "Work type": [
        "Work type not provided"
    ],
    "Benefits": [
        "Benefits not provided"
    ],
    "Job Description": "Job Description\n\n\nJob Title:\n\n\n      Data Analyst\n     \n\n\n\nLocation:\n\n\n      Hyderabad, India\n     \n\n\n\nSchedule:\n\n\n\n\n\nTeam:\n\n\n      84-604 - Media - Ad Operations\n     \n\n\n\nDepartment:\n\n\n\n\n\n\nWhat's your new role about?\n\nRevenue Analyst\n\n\n\n\n    Do you want to be part of DAZN’s ever growing advertising division?\n   \n\n\n\n    At DAZN our Revenue Analyst will help manage and analyse all data relevant to the performance of commercial advertising on DAZN, including impressions, revenue systems, viewership and audience behavior.\n   \n\n\n\n    At DAZN we have a changing environment, therefore, your role and responsibilities vary, one day you could be looking at how well we are monetising our key rights, and the next could be making a business case for new product initiatives including our own inventory forecasting and planning tool. You will have the opportunity to track and deliver insight into the performance of the media division. With a strong commercial mindset, your data presentation and statistical analysis will help dictate ad strategy and KPI’s, whilst providing the division the ability to access and understand the data themselves.\n   \n\n\n\n    You will act as our business owner, working with the larger data and technology teams to define requirements and deliverables to derive meaningful analysis. You may be looking at the advertising and revenue pipelines or working with our Data Scientists to look at forecasting models.\n   \n\n\n\n    You will work with DAZN markets globally, understanding the differences in broadcast and advertising practices, and being able to tailor data-based suggestions accordingly.\n   \n\n\n\n    This is a great opportunity to join a high growth division.\n   \n\n\nAs our new Revenue Analyst, you’ll have the opportunity to:\n\n\n\n\nExplore all data relevant to the performance of commercial advertising on DAZN, including impressions, revenue, viewership, and audience behavior.\nMonitor and own data quality of our internal CRM (Dynamics 365) and inventory management systems.\nDeliver and share reports on a regular and ad-hoc basis, manipulating data across various and changing metrics and dimensions.\nBuild dashboards to support the analysis and reporting of data on a weekly/monthly basis.\nManage data-dependent projects and new processes, from capturing requirements, design, and implementation – in the name of improving data quality.\nBe an expert in all metrics and trends related to advertising and be able to identify insights to explain such trends.\nExplore new initiatives in relation to maximising advertising revenue opportunities through data evaluation, including audience enrichment, new ad concepts, and current delivery refinements.\nWork closely with Advertising Technology Team, supporting the role out of new initiatives and ad formats.\n\n\nYou’ll be set up for success if you have:\n\n\n    Proven experience in evaluation of big data and familiarity with statistical data analysis and visualization tools such as Looker/PowerBi/Tableau\n   \n\n    Advanced knowledge of Microsoft Excel\n   \n\n    Both efficient time-management, task prioritization and strong communication skills – ability to communicate and translate information into actions to senior management.\n   \n\nExperienced in data querying using SQL.\n\n\n    An understanding of the sales cycle within Advertising\n   \n\n\n\n Even better if you have:\n\n\n\n\nAbility to work in a fast-paced and enthusiastic environment.\nExperienced in both broadcast and advertising (particularly sport)\nExperienced in data modelling, particularly focused on revenue models.\nWorking Knowledge of programming knowledge such as Python\nKnowledge of Microsoft Dynamics 365 or similar\nExperience in querying APIs from third parties\n\nHere's a little more about us…\n\n    At DAZN, we bring ambition to life. We are innovators, game-changers and pioneers. So, if you want to push boundaries and make an impact, DAZN is the place to be.\n   \n\n\n As part of our team,you'll have the opportunity to make your mark and the power to make change happen. We're doing things no-one has done before, giving fans and customers access to sport anytime, anywhere. We're using world-class technology to transform sports and revolutionise the industry and we're not going to stop.\n   \n\n\n\n DAZN VALUES – THE ‘HOW’ IN WHAT WE DO:\n\n\n\n\n AMBITIOUS – people who want to make a big impact and drive DAZN forward. \n\n\n\n\nINVENTIVE – people with bright ideas who deliver great new experiences for our customers – and improvements for our business. People who come up with better, simpler ways of doing things.\n\n\n\n\n PASSIONATE – people who are proud of our product, our content and our business – and love to shout about it. People who love what they do and show commitment every day.\n\n\n\n\n BRAVE – people who take difficult decisions to help us focus on improving DAZN, our performance and our results. \n\n\n\n\nSUPPORTIVE – people who know that we achieve more as a team than as individuals. People value inclusion and look out for each other, helping their colleagues enjoy their work and develop their careers. People who consider others before making decisions.\n\n\n\n At DAZN, we are committed to fostering an inclusive environment that values equality and diversity, where everyone can contribute and have their voices heard. This means hiring and developing talent across all races, ethnicities, religions, age groups, sexual orientations, gender identities and abilities.\n   \n\n\n Everyone has the opportunity to make change and impact our DEI journey by joining our ERGs: Proud@DAZN, Women@DAZN, Disability@DAZN and ParentZone.\n   \n\n\n\n    If you’d like to include a cover letter with your application, please feel free to. Please do not feel you need to apply with a photo or disclose any other information that is not related to your professional experience.\n   \n\n\n\n    Our aim is to make our hiring processes as accessible for everyone as possible, including providing adjustments for interviews where we can.\n   \n\n\n\n    We look forward to hearing from you."
}