{
    "Job Title": "Data Analyst",
    "Company": "Vreedhi financial services",
    "Portal Link": "https://in.indeed.com/",
    "job listing link": "https://in.indeed.com/rc/clk?jk=4c5fa8c2a8d8570f&bb=qJDWExsZnQ1VQ7neQdNUpEyYko19JUZpOQSHJYeKCH5Fwye-flfXhf3UDdKYuiKDQkigw2PWGIBtcSN2LaoWXD9QqCexfl5H2pmlfnGyRYPx7lFfv8HlggRinECG3_5F&xkcb=SoBI67M38zocq2XXi50JbzkdCdPP&fccid=b9c0391d16bc090f&cmp=Vreedhi-Financial-Services&ti=Data+Analyst&vjs=3",
    "Location": "Hyderabad, Telangana",
    "Date of Posting": "date not provided",
    "Salary": "From ₹3,00,000 a year",
    "Ratings": "3.5",
    "Shift and Schedule": [
        "Day shift"
    ],
    "Work type": [
        "Full-time"
    ],
    "Benefits": [
        "Health insurance",
        "Provident Fund"
    ],
    "Job Description": "Job Title: Data Analyst\nLocation: Hyderabad\nJob Type: Full-time\nExperience Required: Minimum 2 years\nJob Description:\nWe are seeking a skilled and detail-oriented Data Analyst to join our team. The ideal candidate will have a strong foundation in SQL and advanced Excel, with at least 2 years of experience in data analysis. The role requires a person who can transform data into insights, support decision-making processes, and communicate findings effectively across various teams.\nKey Responsibilities:\n\nAnalyze large datasets to identify trends, patterns, and insights.\nDevelop, maintain, and optimize SQL queries to extract data from databases.\nUtilize advanced Excel functions (e.g., pivot tables, VLOOKUP, macros) to organize and analyze data.\nCreate clear and concise reports, dashboards, and visualizations to communicate key findings.\nCollaborate with cross-functional teams to understand data needs and provide data-driven recommendations.\nEnsure data accuracy and integrity through regular audits and validation processes.\nSupport ad-hoc data requests and contribute to various data-related projects.\n\nRequired Skills & Qualifications:\n\nSQL: Proficient in writing and optimizing SQL queries.\nAdvanced Excel: Strong experience with advanced Excel functionalities, including complex formulas, pivot tables, and macros.\nExperience: Minimum of 2 years of hands-on experience in a data analyst role or similar position.\nCommunication Skills: Excellent verbal and written communication skills, with the ability to present data insights to both technical and non-technical stakeholders.\nAttention to Detail: Strong analytical skills with a keen eye for detail and accuracy.\nProblem-Solving: Ability to approach problems with a methodical and logical mindset.\nTeam Collaboration: Experience working in a collaborative environment and contributing to team goals.\n\nWhat We Offer:\n\nCompetitive salary and benefits package.\nOpportunities for professional development and growth.\nCollaborative and inclusive work environment.\n\nJob Type: Full-time\nPay: From ₹300,000.00 per year\nBenefits:\n\nHealth insurance\nProvident Fund\n\nSchedule:\n\nDay shift\n\nWork Location: In person"
}