{
    "Job Title": "Data Analyst",
    "Company": "Optum",
    "Portal Link": "https://in.indeed.com/",
    "job listing link": "https://in.indeed.com/rc/clk?jk=f4b7aaad6f4777c3&bb=qJDWExsZnQ1VQ7neQdNUpNPT8f1MZbNjnoCSVgc_caDPq4h3oEPFpSdav3ByDT3pDSkyrbrpqEsWPl8u3mCsBsIaQ41NFT1oP2h6BtvJ_ZYz6606fXOwrw%3D%3D&xkcb=SoDG67M38zocq2XXi50ObzkdCdPP&fccid=3c38342724c75954&vjs=3",
    "Location": "Hyderabad, Telangana",
    "Date of Posting": "date not provided",
    "Salary": "salary not provided",
    "Ratings": "3.3",
    "Shift and Schedule": [
        "Shift and schedule not provided"
    ],
    "Work type": [
        "Work type not provided"
    ],
    "Benefits": [
        "Health insurance"
    ],
    "Job Description": "Optum is a global organization that delivers care, aided by technology to help millions of people live healthier lives. The work you do with our team will directly improve health outcomes by connecting people with the care, pharmacy benefits, data and resources they need to feel their best. Here, you will find a culture guided by diversity and inclusion, talented peers, comprehensive benefits and career development opportunities. Come make an impact on the communities we serve as you help us advance health equity on a global scale. Join us to start Caring. Connecting. Growing together.\n\nPrimary Responsibility:\n\nComply with the terms and conditions of the employment contract, company policies and procedures, and any and all directives (such as, but not limited to, transfer and/or re-assignment to different work locations, change in teams and/or work shifts, policies in regards to flexibility of work benefits and/or work environment, alternative work arrangements, and other decisions that may arise due to the changing business environment). The Company may adopt, vary or rescind these policies and directives in its absolute discretion and without any limitation (implied or otherwise) on its ability to do so\n\n\nPreference domain: Banking, Finance & Healthcare.\n Required Qualifications:\n\nExperience of over 5 years as SAS developer with proficient knowledge on UNIX environment\nExperience in SAS maintenance and migration projects\nExpertise debugging capabilities and resolving the issues while executing the code and automate the process\nExperience in requirement analysis, design, development, testing and support of Finance, Banking or Health care domain projects using SAS Technologies\nExperience working with large data sets / systems / warehouses using SAS / SQL to translate data into information for decision making\nSolid programming skills in Base SAS and Advance SAS\nShould be able to Run SAS Base programs/jobs which runs on daily/weekly/monthly basis.\nShould be able to fix jobs due to logic/code issues and able to do jobs modifications based on the requirements.\nShould be able to analyze the code, understand the purpose, modify the code to run successfully\nExtensive knowledge and experience on SAS EG, SAS Base and SAS DI Studio\nAbility to handle multiple priorities and deadlines effectively and efficiently\nProven good communication skills and interact to the customers on frequent basis\nSAS Macros\nSAS SQL\nAutomations of Manual jobs\nGitHub(Code versioning system)\nSAS Enterprise guide\nSAS Data Integration Studio\nBasic Unix\nBasic Python\n\n\nPreferred Qualification:\n\nPython understanding or programming skills\n\n\nAt UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone–of every race, gender, sexuality, age, location and income–deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes — an enterprise priority reflected in our mission."
}